[
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Eric Seidel",
    "talk_title": "Flutter at 10 years",
    "full_abstract": "A look back on 10 years of Flutter. What we were trying to do, what we did, and where we’re going!Did you know Flutter started as a web browser? Or that the first 3 versions of Flutter were in JavaScript? Or that Flutter took 4 years to reach 1.0!? This talk will walk back through some of the eras of Flutter and how I see our coming years unfolding.",
    "date": "2024-09-19 13:15 – 14:00",
    "duration": "45 min",
    "type": "Keynote",
    "tags": "Keynote, Introductory and overview, Flutter Multiplatform (Desktop, Web, Embedded, etc.)",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Matt Carroll",
    "talk_title": "The art of Flutter testing",
    "full_abstract": "Tests are a critical tool for effective app delivery. Learn what it means to test Flutter code, how to start writing tests for a new app, how to evolve tests over time, and how to make an existing app testable.",
    "date": "2024-09-19 14:15 – 14:55",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Flutter Widgets & Layouts, Testing",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Luan Nico",
    "talk_title": "3D Games With Flame",
    "full_abstract": "The Flutter team has finally graced us with full GPU access capabilities as a beta access. We have integrated this into the Flame Engine to allow you to build simple 3D games!While still in its infancy, this talk will introduce you to the world of 3D computing, how it is wired under the hood and implemented in Flame, and how to use our higher level APIs to create your very own game. The talk will go over the basics and theory and showcase the process of building a playable demo step by step.This talk is a spiritual successor of my previous talk \"Flame and (pseudo) 3d\" on Fluttercon Berlin last year, in which I talked about alternative ways of supporting 3D with Flame, and built a software-based 3D rendering engine within Flame. Now with first-class GPU support, we can leverage the full power of the device to render much more intricate meshes and ideas.Repo: github.com/flame-engine/flameWebsite: flame-engine.org",
    "date": "2024-09-19 14:15 – 14:55",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Advanced, Game Development",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Anna Leushchenko",
    "talk_title": "Mobile tech stack at Tide",
    "full_abstract": "Tide is a financial services platform trusted by 500,000+ sole traders, freelancers, and limited companies throughout the UK. We’ve been developing our mobile applications using native technologies for several years, but in pursuit of a solution with better productivity, maintainability, and scalability, we chose to rebuild our products with Flutter. With our codebase not older than a couple of years, we keep it fresh and modern for a productive and joyful developer experience.Join this session where Anna, Senior Staff Engineer and a leading Flutter developer at Tide, will share all technical details about our Flutter project: what state management do we use, how do we implement navigation and API communication, what type of tests do we write, and so on. Additionally, you’ll hear about tools and approaches that support our development process: what our CI solution looks like, how we monitor problems in production, how we maintain our multi-million lines codebase, and even more.",
    "date": "2024-09-19 14:15 – 14:55",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Introductory and overview, Application Architecture / Navigation, Enterprise/Tech Leadership",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "John Manning",
    "talk_title": "Building secure, interoperable healthcare apps in Flutter",
    "full_abstract": "The FHIR® Specification is the global standard for exchanging healthcare data. If you plan to build something that integrates healthcare / FHIR® data in Android…you should use Google’s Open Health Stack. If you plan to build it for Flutter…you should use FHIR-FLI. FHIR-FLI (FHIR® with Flutter Library Integration, pronounced ‘firefly’) is a suite of pub.dev packages that focus on the various aspects of FHIR® integration. Our goal with FHIR-FLI is to create the foundation for the next generation of mobile healthcare applications.This live-coding workshop will build a healthcare-focused Flutter app in real time. Objectives:- Basics of FHIR-FLI (SMART on FHIR launch, RESTful API calls, secure local storage, serialization / deserialization)- Real-world use cases- Implementation best practices specific to healthcare- Secure connections to outside FHIR® Servers",
    "date": "2024-09-19 14:15 – 14:55",
    "duration": "40 min",
    "type": "Workshop",
    "tags": "Workshop, Advanced, Flutter Widgets & Layouts, Security, Third Party Libraries",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Slava Egorov, Vijay Menon, Andrew Brogdon, Todd Volkert, Leaf Petersen, Brandon Badger",
    "talk_title": "Flutter Team Leadership Panel",
    "full_abstract": "Join the Flutter team for a discussion on where Flutter is headed and ask questions of the leadership team.",
    "date": "2024-09-19 15:10 – 16:15",
    "duration": "65 min",
    "type": "Talk",
    "tags": "Panel Discussion, Introductory and overview, Enterprise/Tech Leadership",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Leigha Reid",
    "talk_title": "The future of visual development with FlutterFlow",
    "full_abstract": "In this session, we'll walk you through what FlutterFlow is and how it can benefit Flutter developers. We'll also talk through the product announcements made at FlutterFlow's developer conference - including new features and the overall product direction and strategy.",
    "date": "2024-09-19 15:10 – 15:30",
    "duration": "20 min",
    "type": "Lightning talk",
    "tags": "Lightning talk, Intermediate, Firebase & Flutter, Flutter Widgets & Layouts, Enterprise/Tech Leadership",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "John Manning, Grey Faulkenberry",
    "talk_title": "Building secure, interoperable healthcare apps in Flutter (continued)",
    "full_abstract": "The FHIR® Specification is the global standard for exchanging healthcare data. If you plan to build something that integrates healthcare / FHIR® data in Android…you should use Google’s Open Health Stack. If you plan to build it for Flutter…you should use FHIR-FLI. FHIR-FLI (FHIR® with Flutter Library Integration, pronounced ‘firefly’) is a suite of pub.dev packages that focus on the various aspects of FHIR® integration. Our goal with FHIR-FLI is to create the foundation for the next generation of mobile healthcare applications.This live-coding workshop will build a healthcare-focused Flutter app in real time. Objectives:- Basics of FHIR-FLI (SMART on FHIR launch, RESTful API calls, secure local storage, serialization / deserialization)- Real-world use cases- Implementation best practices specific to healthcare- Secure connections to outside FHIR® Servers",
    "date": "2024-09-19 15:10 – 15:30",
    "duration": "20 min",
    "type": "Workshop",
    "tags": "Workshop, Advanced, Flutter Widgets & Layouts, Security, Third Party Libraries",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Dominik Roszkowski",
    "talk_title": "Background Processing with Flutter and Native Platforms",
    "full_abstract": "Let’s dive into one of the most crucial parts of the mobile development - background processing. There are several ways to achieve it with Flutter and some of them involve a bit of native platform understanding. In this talk I’ll show you how to make it work without losing your mind if you haven’t had any prior native experience.",
    "date": "2024-09-19 17:25 – 18:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Advanced, Application Architecture / Navigation, Flutter Multiplatform (Desktop, Web, Embedded, etc.), Package & Plugin Development",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Manuela Sakura Rommel",
    "talk_title": "Stop Treating Accessibility as an Afterthought: Concrete Steps to Build Inclusive Apps",
    "full_abstract": "In today's digital world, Accessibility is more important than ever. However, Accessibility is often treated as an afterthought in the development process, which can lead to exclusion and frustration for users with disabilities. This talk aims to change that by discussing how to make Accessibility a core part of your development workflow. We will cover topics such as collaboration within your team, available tools and when it makes sense to use them, and modifications to your project to ensure adding Accessibility is a pain-free experience for feature development and testing. By implementing these strategies, you can create a more inclusive product and provide a better user experience for all.",
    "date": "2024-09-19 17:25 – 18:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Accessibiliity",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Lucas Josefiak",
    "talk_title": "Simplify Design Systems and Designer/Developer Collaboration with Widgetbook",
    "full_abstract": "Abstract:Creating beautiful UI has never been easier with Flutter. However, managing and organizing widgets effectively can pose challenges for developers, particularly when it comes to organizing them, testing them in all their different use cases, and maintaining design-code consistency. This is where Widgetbook comes in.In this talk, we will see examples of Flutter companies benefiting from Widgetbook. You can use the open-source Flutter package Widgetbook to build your own design system/widget library. By using the CI/CD integration with Widgetbook Cloud, you can automatically test your widgets across different devices, themes, and languages (managed Golden Tests). In addition, you can connect your Figma designs directly to our Flutter widgets which simplifies the review process with designers. Thereby, you will keep design and code in sync.Key takeaways:- How to build your own design system / widget library- How to automatically test your widgets on different device sizes, themes, languages, etc.- How to use Golden Tests without limitations- How to collaborate effectively with designers and product managers to keep design and code sync- How to use Widgetbook in your processes by seeing real-life examples from existing Widgetbook users",
    "date": "2024-09-19 17:25 – 18:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Flutter Widgets & Layouts, Package & Plugin Development, Testing, Third Party Libraries, Enterprise/Tech Leadership",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Felix Angelov",
    "talk_title": "Join the Flock: Add Shorebird to your Flutter Apps",
    "full_abstract": "In this workshop we’ll walk through all the steps needed to get Shorebird working on a Flutter app of your choice. Either follow along with a provided Flutter app or bring your own app. Along the way we’ll look at how to manage apps, releases, patches, and more using the Shorebird CLI and web console. We will also cover how to use package:shorebird_code_push to customize the user experience.By the end of the workshop, you should have Shorebird’s code push solution integrated into a Flutter app and have a solid understanding of how to deliver over the air updates to your users.",
    "date": "2024-09-19 17:25 – 18:05",
    "duration": "40 min",
    "type": "Workshop",
    "tags": "Workshop, Introductory and overview, Third Party Libraries",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Chris Sells",
    "talk_title": "Dart and Flutter and AI, Oh My!",
    "full_abstract": "In this talk, you'll get a quick into to the latest in generative AI, including how to think about OSS and proprietary models and local vs. cloud-based model access. You'll also learn how to integrate them into your Dart and Flutter apps, including how to build out a chat UI, how to do prompt engineering and how to take advantage of RAG in your Dart and Flutter apps.",
    "date": "2024-09-19 18:25 – 19:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Firebase & Flutter",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Juan Manuel Silveira, Valentina Llavayol",
    "talk_title": "How to be a Gladiator in the Gesture Arena",
    "full_abstract": "Join us as we share our knowledge and experiences with Flutter's Gesture Arena. Flutter's robust gesture system offers extensive capabilities, but managing multiple gestures and resolving conflicts can be challenging. This talk will explore the mechanics of gestures in Flutter, focusing on the Gesture Arena—a system that determines which gesture wins when multiple gestures are recognized simultaneously.We will cover the essentials of the Gesture Arena, providing insights into its logic and how it manages gesture competition. We will delve into our experience dealing with gesture conflicts, having worked on building an application that involved multiple simultaneous gestures such as pinch to zoom, pan, vertical drag, horizontal drag, single tap, and double tap.Real-world cases will be discussed, highlighting how these issues were resolved using GestureRecognizers and a deep understanding of Flutter's Gesture Arena logic. Additionally, we will demonstrate how to create custom gesture detectors, empowering attendees to implement unique gestures tailored to their application's needs.This session aims to equip Flutter developers with the knowledge to effectively manage gestures, resolve conflicts, and enhance user experience.",
    "date": "2024-09-19 18:25 – 19:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Advanced, Flutter Widgets & Layouts",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Kali -",
    "talk_title": "Browser Extensions with Flutter",
    "full_abstract": "Browser extensions are an extremely under-used platform for Flutter developers. Extensions can be used as a supplement to any other platform and with a few tweaks, can take advantage of the power of Flutter by keeping to just one code base. In this talk I'll demo a real world use-case and then go over an example build with some key code components. I'll be covering the major pros and cons of using Flutter with an extension, how to work with browser APIs (including important JavaScript interops), tips on debugging, and best practices.",
    "date": "2024-09-19 18:25 – 19:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Introductory and overview, Flutter Multiplatform (Desktop, Web, Embedded, etc.)",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Gianfranco Papa, Elian Ortega",
    "talk_title": "Going offline first with Flutter: Best practices",
    "full_abstract": "Explore how to design robust Flutter applications with an offline-first approach. This session covers implementing a local database, and we'll cover relational vs non-relational ones. Moreover, we'll center the talks around synchronization techniques, and resolving conflicts using strategies like \"Last Write Wins\" and Conflict-Free Replicated Data Types (CRDTs). By the end of the talk, you'll hopefully understand key points on how to start creating apps that are offline by default to provide seamless experience to your users even in low connection environments, enhancing user experience regardless of connectivity.",
    "date": "2024-09-19 19:25 – 20:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Advanced, Dart on the server, Networking (GraphQL, APIs, etc.)",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Norbert Kozsir",
    "talk_title": "Compilers, Virtual Machines and Code Analysis - What makes Dart and Flutter run",
    "full_abstract": "This advanced session takes a look at what powers Flutter under the hood. This will include everything but the typical code you write day to day.Key topics:- The Dart compiler- The DartVM- The Dart Analyzer- The EngineEach topic will consist of some high-level overview & fun examples of things you can do.After the talk, you should have gained a general understanding of how Flutter and Dart work under the hood and be equipped with basic knowledge to start building tools for the Dart and Flutter ecosystem.",
    "date": "2024-09-19 19:25 – 20:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Expert, Custom Painting / Render Objects / Rendering, Flutter Multiplatform (Desktop, Web, Embedded, etc.)",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Marcin Chudy",
    "talk_title": "Flutter Add-to-App: The Good, the Bad and the Ugly",
    "full_abstract": "Flutter add-to-app can be a very tempting way to introduce Flutter in an organization that is maintaining native apps. How easy it is, though, to just put Flutter inside a large iOS or Android application? Is it as straightforward as starting a new Flutter project? What are possible approaches that we can take when considering such integration?In this talk, we’ll take a look at some challenges that appeared during the development of a proof-of-concept Flutter project by LeanCode for one of the clients from the banking sector. We’ll go through all important parts of mobile app development and see how add-to-app compares to standalone Flutter development. We’ll touch on such topics as UI, navigation, networking, DX, native libraries, background processing, app size, performance, and CI.",
    "date": "2024-09-19 19:25 – 20:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Application Architecture / Navigation, Package & Plugin Development",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "John Ryan, Justin McCandless",
    "talk_title": "Advanced animations in Flutter",
    "full_abstract": "Learn how to add beautiful and customized animations to your Flutter app, and understand how Flutter's animation system works under-the-hood.",
    "date": "2024-09-19 19:25 – 20:05",
    "duration": "40 min",
    "type": "Workshop",
    "tags": "Workshop, Advanced, Animations",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Moritz Theis",
    "talk_title": "M&Ms Your Way: Build a Fun, Flutter-Powered Candy Dispenser (with Live Treats!) on Raspberry Pi 5",
    "full_abstract": "Tired of boring M&M mixes? Take control with Flutter! This talk dives into building a custom M&M dispenser you control with code, powered by the mighty Raspberry Pi 5.We'll ditch the screens and get our hands dirty (well, maybe not that dirty) as we:– Craft a sweet user interface to pick your perfect M&M color combo.– Unlock the secrets of connecting Flutter to real-world hardware (cue the M&M rain!).– Learn how to make your own interactive Flutter projects beyond the phone, leveraging the power of Raspberry Pi 5.Get ready for a sugar rush of knowledge (and maybe some real M&Ms)! This session features a live demo of the M&M dispenser on stage, so you can create your own custom mix.Calling all curious coders! This talk is perfect if you want to see Flutter in action on Raspberry Pi 5 and build something fun - with a delicious reward.",
    "date": "2024-09-19 20:25 – 21:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Flutter Multiplatform (Desktop, Web, Embedded, etc.)",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Tsavo Knott",
    "talk_title": "Building Pieces for Developers: Our Journey with Flutter and Dart",
    "full_abstract": "Join Tsavo Knott, CEO and Technical Co-Founder, for an in-depth look at how we built Pieces for Developers using Flutter and Dart. In this session, we'll discuss why we chose Flutter for our UI framework and how we ensure native extensibility as well as cross-platform compatibility and consistency when building a suite of on-device productivity tools that work across MacOS, Windows, and Linux.From this talk, you will gain insight into:1. Leveraging Flutter for Cross-Platform Development: Discover how we harnessed the power of Flutter to create an extensible user experience across MacOS, Windows, and Linux, reducing development time and effort.2. Seamless and Consistent User Experiences Across Multiple Products: Discover how we created a beautiful user experience across our entire suite of tools, including syntax highlighters, by leveraging AOT (Ahead-of-Time) Flutter micro-apps to ensure consistency & high performance.3. Extending the Dart Language: Hear a brief overview of our work in extending the Dart language and open-sourcing the result with the runtime_native_semaphores package. 4. Future-Proofing with Flutter and Dart: Explore how our choice of Flutter and Dart positions Pieces for Developers for future enhancements and scalability, ensuring we can continue to meet the evolving needs of the developer community.",
    "date": "2024-09-19 20:25 – 21:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Flutter Multiplatform (Desktop, Web, Embedded, etc.), Flutter Widgets & Layouts, Package & Plugin Development",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Viktor Lidholt",
    "talk_title": "From frontend to backend with Serverpod",
    "full_abstract": "Are you a Flutter developer who wants to learn more about building your app's backend? Then this session is for you. It will walk you through the journey of moving from frontend to backend development. You will learn how to set up and deploy your Dart server with Serverpod, send data to and from your server, create endpoints and methods, and connect to a database. After the session, you will be ready to create your own full-stack app written entirely in Dart.",
    "date": "2024-09-19 20:25 – 21:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Dart on the server",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "John Ryan, Justin McCandless",
    "talk_title": "Advanced animations in Flutter (continued)",
    "full_abstract": "Learn how to add beautiful and customized animations to your Flutter app, and understand how Flutter's animation system works under-the-hood.",
    "date": "2024-09-19 20:25 – 21:05",
    "duration": "40 min",
    "type": "Workshop",
    "tags": "Workshop, Advanced, Animations",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Slava Egorov, Michael Thomsen, Vijay Menon, Kevin Moore, Leaf Petersen",
    "talk_title": "Future of Dart Panel",
    "full_abstract": "Future of Dart Panel from the Google Flutter/Dart team.",
    "date": "2024-09-19 21:20 – 22:00",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Panel Discussion, Introductory and overview, Dart 3 Language Features, Dart on the server, Enterprise/Tech Leadership",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Kyle Finlinson",
    "talk_title": "Implications of Flutter Wasm",
    "full_abstract": "Most Dart Wasm talks I've heard are (great!) technical updates about building a compiler, etc.This talk will focus on:- What is WebAssembly (Wasm) and why is it exciting?- User and developer benefits of using Wasm- Use cases for which Wasm is especially well suited (or not)- Why Flutter+Dart (and Kotlin) are well positioned to lead the WasmGC frontier- Implementation considerations such as: - How many users are likely to have a browser that supports Wasm? (Now and in the next ~year) - Gotchas when you know some users will fall back to JS - Embedding Flutter Wasm components in another web page",
    "date": "2024-09-19 21:20 – 22:00",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Introductory and overview, Flutter Multiplatform (Desktop, Web, Embedded, etc.)",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Scott Stoll",
    "talk_title": "Controlling App Screens Remotely with RFW and Gemini AI",
    "full_abstract": "Remote Flutter Widgets (RFW) is a package that allows developers to change the layout of a screen remotely, dynamically, at runtime. If you are an Android dev, think \"Changing Views and Screens Dynamically via Remote Server\". But what if we substitute Gemini for that server, and allow it to decide what to show the user at any given moment based on information about what the user is doing on the app at the time?It's not that it can be done, it has been done. Imagine what you could do with it, and come find out how!",
    "date": "2024-09-19 21:20 – 22:00",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Flutter Widgets & Layouts",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "David DeRemer",
    "talk_title": "Build to Succeed with Flutter — A commercial roadmap for the community",
    "full_abstract": "The Flutter community is thriving, but much remains to unlock its full potential. Complementing the Flutter team’s annual product roadmap, this session presents a commercial roadmap for Flutter’s economic growth. Drawing on VGV’s enterprise Flutter expertise, we’ll share an actionable vision to align the community for long-term success. Learn how together we can generate revenue, drive business strategy, and create new opportunities within the Flutter ecosystem. This landmark talk will inspire and guide the many teams committed to Flutter’s future success.",
    "date": "2024-09-20 13:15 – 14:00",
    "duration": "45 min",
    "type": "Keynote",
    "tags": "Keynote, Introductory and overview, Enterprise/Tech Leadership",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Gianfranco Papa",
    "talk_title": "The power of Macros in Dart",
    "full_abstract": "The Dart macro system is a new major feature of the language currently in development that adds support for static metaprogramming to the Dart language.We have seen many improvements in this new functionality coming to Dart. In the talk, we will explore the current state and how it is projected to work.Additionally, we will discuss different use cases and the changes it could bring to the use of Flutter and Dart in our daily lives as developers.",
    "date": "2024-09-20 14:20 – 15:00",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Advanced, Dart 3 Language Features, Package & Plugin Development",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Jaime Blasco",
    "talk_title": "Flutter on the Big Screen: Building TV apps",
    "full_abstract": "Flutter on the big screen is here! In this session, we'll explore the current state of Flutter development for smart TVs. We'll delve into the tools and techniques for building cross-platform TV apps, covering Android TV, Apple tvOS, Samsung Tizen and LG webOS. We'll compare and contrast the support offered by each platform, uncovering their unique quirks and strengths. Learn how to leverage Flutter's power to create engaging, seamless experiences across the living room's most popular platforms.",
    "date": "2024-09-20 14:20 – 15:00",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Flutter Multiplatform (Desktop, Web, Embedded, etc.), Third Party Libraries",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Danielle Cox",
    "talk_title": "Packages - Use code you have already written to contribute to the Flutter ecosystem.",
    "full_abstract": "At Danielle's job, her team has created a JSON driven integration testing suite and are turning it into a Flutter package. Now she will share this experience of turning your existing code into a package on pub.dev with you, including:1) When is a package appropriate?2) How to turn specific solutions into generic workflows3) What doesn't belong in your package (ie what to remove before sharing)4) Publishing responsibilityAt the end of the session we will live code an actual update to the package and publish it from the stage!.",
    "date": "2024-09-20 14:20 – 15:00",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Package & Plugin Development, Testing",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Anna Leushchenko",
    "talk_title": "Basic and advanced networking in Dart and Flutter",
    "full_abstract": "Most applications, be it mobile, web, or desktop, depend on some kind of backend. Thus, an API layer is an integral part of application implementation. This is a hands-on workshop, where Anna will present tools and approaches that facilitate an effective API layer implementation in Flutter and Dart applications.We will apply this knowledge together to create a Flutter application that displays data obtained from a hosted REST API. You will walk away with knowledge about code generation in Dart and its application examples, and learn a few cool hacks on how to turn its principles to your advantage.",
    "date": "2024-09-20 14:20 – 15:00",
    "duration": "40 min",
    "type": "Workshop",
    "tags": "Workshop, Intermediate, Application Architecture / Navigation, Networking (GraphQL, APIs, etc.), Third Party Libraries",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Marcus Twichel",
    "talk_title": "HTMX + Dart = A Good Idea?",
    "full_abstract": "HTMX, the rising star in the world of web development, is revolutionizing how we build dynamic and interactive websites. Its popularity stems from its ability to simplify the creation of complex websites without importing large Javascript libraries. Thanks to Dart Frog – a powerful, Dart-based backend framework – Flutter developers can seamlessly leverage their existing skills to build full-fledged web solutions using this exciting technology. In this session, we'll dive into the unique capabilities of both HTMX and Dart Frog, and we’ll demonstrate how their combined power can simplify web development and enable any Dart developer to make an engaging website.",
    "date": "2024-09-20 15:15 – 15:35",
    "duration": "20 min",
    "type": "Lightning talk",
    "tags": "Lightning talk, Introductory and overview, Dart on the server",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Matt Carroll",
    "talk_title": "Stop centralizing! A humble approach to Flutter app architecture.",
    "full_abstract": "From navigation, to state management, to test cases, Flutter developers love to centralize. But centralization hurts the long-term viability of your code. Learn how to utilize humble patterns to decentralize your code and accelerate your team.",
    "date": "2024-09-20 15:15 – 15:35",
    "duration": "20 min",
    "type": "Lightning talk",
    "tags": "Lightning talk, Intermediate, Flutter Widgets & Layouts",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Anthony Prakash",
    "talk_title": "Is Flutter here to stay?",
    "full_abstract": "A lot of folks in the Flutter Community have been worried about the future of Flutter and what it means to be a Flutter developer.We will take stock of all the concerns from the community, take stock of answers from Google, the Flutter community leaders and companies deeply invested in Flutter on what they think about this concern which will help you decide for yourself.",
    "date": "2024-09-20 15:15 – 15:35",
    "duration": "20 min",
    "type": "Lightning talk",
    "tags": "Lightning talk, Intermediate, Firebase & Flutter, Enterprise/Tech Leadership",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Anna Leushchenko",
    "talk_title": "Basic and advanced networking in Dart and Flutter (continued)",
    "full_abstract": "Most applications, be it mobile, web, or desktop, depend on some kind of backend. Thus, an API layer is an integral part of application implementation. This is a hands-on workshop, where Anna will present tools and approaches that facilitate an effective API layer implementation in Flutter and Dart applications.We will apply this knowledge together to create a Flutter application that displays data obtained from a hosted REST API. You will walk away with knowledge about code generation in Dart and its application examples, and learn a few cool hacks on how to turn its principles to your advantage.",
    "date": "2024-09-20 15:15 – 15:35",
    "duration": "20 min",
    "type": "Workshop",
    "tags": "Workshop, Intermediate, Application Architecture / Navigation, Networking (GraphQL, APIs, etc.), Third Party Libraries",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "David DeRemer, Sam Moore",
    "talk_title": "Successful Flutter Re-Platforming — The Path For Betterment",
    "full_abstract": "Re-platforming native mobile apps to Flutter presents huge opportunities but also significant risks. Join Betterment and VGV as they showcase Betterment’s successful transformation using add-to-app for seamless ongoing development. Discover how Betterment built a business case, validated Flutter, executed a comprehensive plan, and navigated a culture shift. This session will share their journey, benefits, and lessons learned, offering invaluable insights for any company looking to drive growth with Flutter.",
    "date": "2024-09-20 15:50 – 16:30",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Enterprise/Tech Leadership",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Daco Harkes, Moritz Sümmermann",
    "talk_title": "Building a package with assets",
    "full_abstract": "Join us for a demo of bundling assets in standalone Dart packages. “Assets” are a new feature in Dart and Flutter which enable seamless building, bundling, and tree-shaking of native code and data assets in a Dart package. We’ll show how to create a package with assets from scratch using FFIgen, a build hook and a link hook. Bring your own assets and join us on the journey!",
    "date": "2024-09-20 15:50 – 16:30",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Flutter Multiplatform (Desktop, Web, Embedded, etc.), Package & Plugin Development",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Matteo Maria Terzuolo",
    "talk_title": "Pattern Matching to the rescue!",
    "full_abstract": "This talk is going to be a deep dive into Pattern Matching in Dart. We'll explore how Dart simplifies dealing with complex data structures using clear and intuitive patterns.We'll uncover real-world applications and share some neat tricks to maximize the potential of this powerful feature.So buckle up, because by the end of this session, you'll be ready to level up your Dart game and tackle those data structures like a pro!",
    "date": "2024-09-20 15:50 – 16:30",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Dart 3 Language Features",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Anna Leushchenko",
    "talk_title": "Basic and advanced networking in Dart and Flutter (continued)",
    "full_abstract": "Most applications, be it mobile, web, or desktop, depend on some kind of backend. Thus, an API layer is an integral part of application implementation. This is a hands-on workshop, where Anna will present tools and approaches that facilitate an effective API layer implementation in Flutter and Dart applications.We will apply this knowledge together to create a Flutter application that displays data obtained from a hosted REST API. You will walk away with knowledge about code generation in Dart and its application examples, and learn a few cool hacks on how to turn its principles to your advantage.",
    "date": "2024-09-20 15:50 – 16:30",
    "duration": "40 min",
    "type": "Workshop",
    "tags": "Workshop, Intermediate, Application Architecture / Navigation, Networking (GraphQL, APIs, etc.), Third Party Libraries",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Toni Piirainen",
    "talk_title": "Digital transformation of media industry with Flutter",
    "full_abstract": "In this Rebel story, we'll explore the valuable lessons we've learned over our 17-year history of developing digital services and applications, with a special focus on our 6 years of experience with Flutter. During this time, we've created multiplatform and highly scalable end-to-end services for globally recognized brands like Netflix, Burger King, and Schaeffler.We will dive deep into the KSML case study, illustrating how Rebel, using Flutter and the Flutter News Toolkit, digitally transformed the business of a major media company.By the end of this story, you'll gain a comprehensive understanding of the strategic decisions big companies make when investing in Flutter applications, and why we at Rebel recommend Flutter in 9 out of 10 application cases.",
    "date": "2024-09-20 17:40 – 18:20",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Introductory and overview, Enterprise/Tech Leadership",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Angjelko Miloshevski",
    "talk_title": "The Dark Arts of RenderSliver: Mastering Custom Slivers in Flutter",
    "full_abstract": "Dive into the world of custom sliver widgets using Flutter's powerful RenderSliver API. This session is perfect for developers eager to push the boundaries of their Flutter applications with advanced layout techniques.I'll begin with a short introduction to Slivers and the RenderSliver API, and how it fits into the broader Flutter rendering framework.Next we will go step-by-step using a real user use case example of designing and implementing a custom Sliver widget.We will take a look at how we can layout and paint the Sliver and its children, and what's the role of SliverConstraints and SliverGeometry.Lastly we will see how we can make some parts of the Sliver responsive to touch and how we can customize the look of the Sliver while painting it on the screen.This session will elevate your understanding of Flutter's rendering capabilities and empower you to create custom Sliver widgets that enhance your app's user interface and performance.",
    "date": "2024-09-20 17:40 – 18:20",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Advanced, Custom Painting / Render Objects / Rendering, Flutter Widgets & Layouts",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Leo Farias",
    "talk_title": "Generative UI with Flutter",
    "full_abstract": "This session will introduce you to the fundamentals of generative UI, a technique that enables dynamic and adaptive user interfaces based on various inputs and conditions.We’ll explore how to leverage the Gemini model with the google_generative_ai SDK to implement practical generative UI solutions, discuss real-world use cases, and highlight essential design principles for building adaptive interfaces.You’ll also learn best practices for ensuring design consistency, improving performance, and managing complexity when applying generative approaches in production applications.",
    "date": "2024-09-20 17:40 – 18:20",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Flutter Widgets & Layouts, Third Party Libraries",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Ander Dobo",
    "talk_title": "Package Ecosystem Summit Session 1 - Adding support for Swift Package Manager",
    "full_abstract": "Unconference style discussion of the Flutter and Dart Package Ecosystem Summit. The discussion topic is the Adding support for Swift Package Manager.Read up at: https://docs.flutter.dev/packages-and-plugins/swift-package-manager/for-plugin-authorsThe discussion will be facilitated by 1-2 moderators.",
    "date": "2024-09-20 17:40 – 18:20",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Package & Plugin Development",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Jaime Wren",
    "talk_title": "Revving up your Flutter IDE",
    "full_abstract": "Join us in the driver's seat as we go from 0 to 60 into dev tooling. Hear from the Flutter team what all developers need to know about their VS Code, Android Studio, Dart DevTools and CLI tooling. We'll take a side by side look at both the latest VS Code & Android Studio support, as well as other core products. Jump into the hot-(reload) seat for the first time or tune up your tooling knowledge.",
    "date": "2024-09-20 18:35 – 19:15",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Introductory and overview, Enterprise/Tech Leadership",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Giuseppe Cianci",
    "talk_title": "Building Offline AI: Integrating CNN Models with Flutter Using TensorFlow Lite",
    "full_abstract": "Are you interested in harnessing the power of artificial intelligence directly on mobile devices? Do you want to learn how to integrate computer vision capabilities into your Flutter apps, running models offline for real-time performance and enhanced privacy? Join this talk to discover how to build a simple AI app with Flutter using TensorFlow Lite, enabling powerful AI features even without internet connectivity.In this session, you will:1. *Dive into Convolutional Neural Networks (CNNs):* Understand the fundamentals of CNNs, the backbone of most computer vision applications, and why they're essential for tasks such as image recognition and object detection.2. *Explore TensorFlow Lite:* Learn how to convert and optimize your TensorFlow models to TensorFlow Lite for efficient on-device inference. Discover the steps to integrate TensorFlow Lite with your Flutter app seamlessly.3. *Build a Real-world AI App:*Follow a step-by-step guide to develop a Flutter app that runs a CNN model locally, enabling features like image classification and object detection without needing a network connection.4. *Optimize for Performance:*Get practical tips on optimizing your Flutter app for performance, ensuring smooth and efficient AI computations even on resource-constrained devices.By the end of this session, you'll be equipped with the knowledge and tools to integrate sophisticated AI capabilities into your Flutter apps, creating powerful, offline-ready applications that leverage the latest advancements in machine learning.Don't miss this opportunity to elevate your Flutter development skills and bring cutting-edge AI to your mobile applications!",
    "date": "2024-09-20 18:35 – 19:15",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Advanced, Flutter Multiplatform (Desktop, Web, Embedded, etc.), Package & Plugin Development",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Marcus Twichel, Samantha O'Brien",
    "talk_title": "SwiftUI for Flutter Developers",
    "full_abstract": "Why would a Flutter developer need to learn SwiftUI? We love the efficiency of building multi-platform apps, but sometimes you want to incorporate platform-specific features that make iOS apps stand out. Luckily for us, SwiftUI offers a familiar development experience to Flutter and opens the door to these native capabilities. From WatchOS apps to home screen widgets, Live Activities, and App Clips, we’ll demonstrate how incorporating SwiftUI allows you to implement these features seamlessly within your Flutter apps to create more dynamic and useful user experiences.We'll start by exploring the reasons to embrace SwiftUI as a Flutter developer. Next, we’ll delve into the SwiftUI syntax, how the developer experience compares to Flutter, and demonstrate how simple it is to transfer your Flutter skills to SwiftUI! Finally, we will have a hands-on live coding session on how to build a Home Screen Widget using SwiftUI and integrate it into a Flutter app. As a bonus, we’ll publish a template to help jump-start adding a home screen widget to your app.This talk is perfect for Flutter developers who want to expand their skill set, add unique iOS features to their apps, and create a more comprehensive user experience across the Apple ecosystem.",
    "date": "2024-09-20 18:35 – 19:15",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Flutter Multiplatform (Desktop, Web, Embedded, etc.), Package & Plugin Development, Third Party Libraries",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Ander Dobo",
    "talk_title": "Package Ecosystem Summit Session 2 - Past, Present and Future of Native Interop",
    "full_abstract": "Unconference style discussion of the Flutter and Dart Package Ecosystem Summit. The discussion topic is the Past, Present and Future of Native Interop.Watch this talk beforehand to learn more: https://www.droidcon.com/2024/09/02/the-past-present-and-future-of-native-interop/The discussion will be facilitated by 1-2 moderators.",
    "date": "2024-09-20 18:35 – 19:15",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Package & Plugin Development",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Roman Jaquez",
    "talk_title": "A Deep Dive into Dart FFI: Unleashing Flutter at Philips Research",
    "full_abstract": "The healthcare landscape is undergoing a digital revolution, and Flutter is emerging as a powerful tool for crafting innovative medical applications. This presentation delves into Dart FFI, a game-changer that unlocks the true potential of Flutter in healthcare. We'll explore how Dart FFI bridges the gap between Dart (Flutter's programming language) and C++, enabling developers to leverage the power of existing C++ libraries. This empowers the creation of mHealth apps that seamlessly integrate with medical devices, perform complex data analysis using established C++ libraries, and deliver exceptional performance for computationally intensive tasks.",
    "date": "2024-09-20 19:30 – 20:10",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Advanced, Animations, Flutter Multiplatform (Desktop, Web, Embedded, etc.), Flutter Widgets & Layouts, State Management",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Rona Kilmer",
    "talk_title": "Accessibility and the Web: Lessons Learned from Adding Accessibility to a Flutter Web App",
    "full_abstract": "Ensuring your Flutter web app is accessible is important and while the Flutter framework gives you a lot of accessibility for free, it doesn’t get you all the way there. Web apps are unique from mobile apps in several ways, particularly when it comes to accessibility. This talk goes beyond the basics of semantics. You will learn about the unique struggles I encountered while ensuring our web app was accessible and the solutions I found to work around the issues.",
    "date": "2024-09-20 19:30 – 20:10",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Accessibiliity",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Jorge Coca",
    "talk_title": "Demystifying performance tune up in Flutter and Dart",
    "full_abstract": "The DevTools can be intimidating and scary. After all, they might be tools we don't have to use often, and when we do, it is because something might be wrong. High memory consumption? Battery drain? Bundle size? Jank? Understanding, analyzing, and debugging these issues has been a task traditionally reserved only for the brave, but not anymore!In this talk, we will make performance improvements a topic no one should fear by turning a poor-performing app into a delightful experience!",
    "date": "2024-09-20 19:30 – 20:10",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Application Architecture / Navigation, Testing",
    "room": "Regency Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Ander Dobo",
    "talk_title": "Package Ecosystem Summit Session 3 - Sustainable package maintenance models",
    "full_abstract": "Unconference style discussion on sustainable models to keep important packages that are no longer maintained alive.The discussion will be facilitated by 1-2 moderators.",
    "date": "2024-09-20 19:30 – 20:10",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Package & Plugin Development",
    "room": "Chapel 1: Workshops & Ecosystem Summit"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Anna Leushchenko, Danielle Cox, Rona Kilmer, Leigha Reid, Kali -",
    "talk_title": "Flutteristas Panel",
    "full_abstract": "Join the Flutteristas as they discuss the world of Flutter and Dart as well as challenges faced in the industry by female and non-binary individuals and how they are breaking through barriers.",
    "date": "2024-09-20 20:25 – 21:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Panel Discussion",
    "room": "Imperial Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Jeff Ward",
    "talk_title": "Dart Beyond Flutter: Journeys in Embedding Dart",
    "full_abstract": "Dart is more than the language of Flutter. It can be compiled to JavaScript and WASM for the browser, and it can be used for console scripts and server applications. With some work, you can even embed Dart into other programs. Embedding Dart allows you to use it as a high level language for complex applications, such as a scripting language for a game. But what is the process of embedding Dart actually like? This talk will discuss the hurdles involved when embedding Dart in other programs, explore some of the inner workings of Dart as an embedded language, and show working examples of embedded Dart.",
    "date": "2024-09-20 20:25 – 21:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Dart on the server, Flutter Multiplatform (Desktop, Web, Embedded, etc.), Game Development",
    "room": "Empire Room"
  },
  {
    "source": "https://web.archive.org/web/20241212151813/https://flutterconusa.dev/",
    "conference_name": "FlutterCon USA 2024",
    "talk_author": "Stefan Hodges-Kluck, Tom Arra",
    "talk_title": "Supercharging Development with Full Stack Dart and AWS",
    "full_abstract": "When building a product today, engineering teams need to use the building blocks they have to level up their team and get to market quickly and safely. One way we have seen this done is to adopt the use of Dart on the backend to ensure your frontend and backend developers are literally speaking the same language and can easily share code between systems without sacrificing performance. In this session we will dive into the logistics behind this and show it in practice with AWS. With the speed and flexibility that Amplify and Dart offer, we can easily connect AWS Cloud Services with a robust full stack application. We will demonstrate how you can create this stack from scratch but also link up your existing cloud infrastructure so you can start building in this setup now, instead of waiting for your next project. Come learn how AWS Amplify and Dart Frog can supercharge your development team today.",
    "date": "2024-09-20 20:25 – 21:05",
    "duration": "40 min",
    "type": "Talk",
    "tags": "Session, Intermediate, Dart on the server, Third Party Libraries",
    "room": "Regency Room"
  }
]