[
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Craig Labenz",
    "talk_title": "Life cycle of a RenderObject",
    "full_abstract": "A follow-up to Craig's \"Life cycle of a Widget\" talk from Flutter Vikings 2022, Craig will present what takes place in the Flutter framework below the widget tree and element tree. Learn about how the render tree collapses your widgets into your UI and how Flutter ultimately convinces your users' GPUs to render your app.",
    "date": "2024-02-23 09:30",
    "duration": "50 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Francois Nollen, Alexandre Poichet, Alexis Choupault",
    "talk_title": "Mind your app footprint! 🐾⚡🌱",
    "full_abstract": "Your app footprint is important. \r\nSize, network and battery usage matter. Particularly when used by millions of people. \r\n\r\nHopefully, there are many ways to optimise your Flutter mobile app: \r\n\r\nReducing bundle sizes with Android App Bundle, Tree Shaking, Deferred Components \r\n\r\nMoving out logic, libs and SDKs from your frontend \r\n\r\nTuning for low-end devices, available bandwidth or battery \r\n\r\nNetwork caching, optimising payloads and assets \r\n\r\nDisabling animations and features \r\n\r\nUsing the right thread strategy \r\n\r\nDark mode \r\n\r\n...And more! \r\n\r\nIn this talk, you will learn various techniques to reduce your app footprint 🌱, save old devices ⚡️ and make users happier at the end of the day 😊.",
    "date": "2024-02-23 10:20",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Alexandre Moureaux",
    "talk_title": "Debugging performance issues with the Flutter DevTools",
    "full_abstract": "Alexandre has built a dummy app with several performance issues from real life examples. During his talk, can everyone work together to debunk those issues?\r\nThrough live-coding, let’s fix those issues, leveraging the power of the performance view in the DevTools. As an added bonus, Alexandre will present a neat way to establish a performance indicator, to evaluate easily the impact of our changes.",
    "date": "2024-02-23 11:30",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Alessandro D'Angelo",
    "talk_title": "The importance of Accessibility In Flutter - How to Build better inclusive Apps",
    "full_abstract": "Around 15 percent of the population lives with disabilities, they are the world’s largest minority. Nowadays, is not only a plus to create good and universal products for everyone, its also a must, in fact, starting from June 2021 as the European Law states, Mobile government Applications should be accessible, and from June 2025 the ones created by private companies.\r\n\r\nIn this speech, you will learn that accessibility in Flutter is as good as in Native, and it is very easy to create AA-grade accessible apps. The keyword is: Keep it simple!\r\n\r\nFor this purpose, I will cover the following topics:\r\n- Design, The step before the Development: Why the collaboration between the design team and you is important to build accessible Apps with Flutter. \r\n- The Flutter Approach to Accessibility\r\n- The most important things to keep in mind when developing Accessible Apps with Flutter and the benefits of using the correct development strategies and mindset more than just following documentation.\r\n- How to use and not to Widgets and accessibility Methods\r\n- How to test Accessibility and what you can test.\r\n\r\nThis talk is for Flutter developers of any seniority who are interested in learning how to build better Apps for everyone. It will help junior developers to start thinking in an accessible way and Senior or management roles who want to approach Flutter in projects that require accessibility but are not sure about the potentialities of this framework. \r\nThe speech will be approximately 40 minutes long, fun guaranteed!",
    "date": "2024-02-23 12:10",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Mateusz Wojtczak",
    "talk_title": "What's Patrol and why you should use it",
    "full_abstract": "Testing is often omitted because of lack of time or \"higher priorities in the project\". One of the frequent excuses is also \"testing being too cumbersome and time-consuming\".\r\n\r\nIt's not true anymore. With Patrol you can enhance your golden/widget/E2E integration tests without a hassle.\r\n\r\nI will talk about our Patrol package from LeanCode - Flutter UI testing framework and learn it from scratch. Why you should use Patrol, where you can use it and how you can make your testing game better - we will cover all these topics during the talk. Also, we'll try to run our tests on Firebase Test Lab.",
    "date": "2024-02-23 12:50",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Alex Casagrande, Giulia Pizzicoli",
    "talk_title": "Security journey in Flutter apps",
    "full_abstract": "Designing and developing secure applications is becoming more and more relevant in the latest years. In this session will explore key security considerations in Flutter offering practical insights into secure coding, network security and anti-tampering.",
    "date": "2024-02-23 14:30",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Nicolò Sordoni",
    "talk_title": "Flutter state management: Bloc vs Riverpod",
    "full_abstract": "Join this insightful talk comparing Bloc and Riverpod for state management in Flutter and explore their strengths, weaknesses, and use cases, gaining valuable insights into implementation, performance, and flexibility.\r\nWitness practical implementation examples showcasing the power of both libraries.\r\n\r\nWhether you're a beginner or experienced developer, this talk equips you with code-based knowledge to make informed decisions.",
    "date": "2024-02-23 15:05",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Matteo Maria Terzuolo",
    "talk_title": "Dart FFI: A Beginner's Guide to High-Performance Integration",
    "full_abstract": "Dart is a versatile language that can be used to build a wide range of applications. However, sometimes you need the performance of another language, such as C or Rust, for certain tasks. That's where Dart FFI comes in.\r\n\r\nDart FFI allows you to call functions written in other languages directly from your Dart code. This can be a great way to boost the performance of your Dart application for specific tasks, such as image processing, numerical computing, or machine learning.\r\n\r\nWith that said, it's important to ask yourself: **Is FFI always the best way to boost performance?**\r\n\r\nIn this talk, we will discuss the benefits and challenges of using Dart FFI. We will also explore some alternative ways to improve the performance of your Dart application.",
    "date": "2024-02-23 15:40",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Adrian Woerle",
    "talk_title": "Unlocking Flutter Success: A Journey from Theory to Practical Architecture",
    "full_abstract": "In the dynamic world of Flutter app development, success hinges on more than just code - it demands a strategic architecture. This talk explores the nuances of application architecture, putting the focus on readability, scalability, and maintainability. While Flutter provides recommendations, it lacks a comprehensive guide for app architecture. \r\n\r\nThe session aims to demystify this complexity, providing valuable insights to implement a robust architecture for your Flutter app. The first segment dives into architecture on an abstract level on the example of the recommended app architecture by Google. We explore fundamental components like the UI-, Domain- and Data-Layer, spotlighting key concepts such as separation of concerns, unidirectional data flow, and state hoisting. \r\n\r\nJumping from theory to practice, the second part offers code examples, illustrating the architecture's implementation. By the session's end, you will possess a great starting point to confidently architect your next Flutter project, tailoring the approach to suit your unique needs. Join us on this enlightening journey from theory to practical success and unlock the full potential of your Flutter app development endeavours.",
    "date": "2024-02-23 16:40",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Thomas Coumau, Maxime Rougieux",
    "talk_title": "Animation vs delivery, do you really have to choose ?",
    "full_abstract": "We love Flutter, primarily because of its seamless and captivating animations. These animations don't just add visual appeal—they instil identity and authenticity into an application. Yet, persuading stakeholders or even fellow team members of their worth can be challenging. Mainly because we couldn't always estimate precisely how long a particular animation would take to implement.\r\n\r\nWith this in mind, we decided to dive deep. We wanted to understand Flutter animations inside out and make them efficient, without wasting hours.\r\n\r\nFor over a year now, we (Thomas and Maxime) have led company-wide Flutter animation challenges called “UI & Animations Dojos”. Our objective? To collaboratively enhance our skills and guide fellow developers in seamlessly integrating animations.\r\n\r\nHere are some of the topics we’ll tackle during the talk:\r\n\r\n- The different ways to animate Flutter recommends and how to use them in real life cases.\r\n- How to figure out if adding that fancy animation is going to blow your project timeline.\r\n- Tips to code animations faster and smarter based on a live coding session.\r\n\r\nBy the end, you'll gain a better grasp on estimating the time required to implement a specific animation, aiding in prioritising what's most essential for your application.",
    "date": "2024-02-23 17:20",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "Auditorium"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Dario Digregorio",
    "talk_title": "Building Responsive UIs in Flutter",
    "full_abstract": "Flutter has become a go-to framework for developing cross-platform apps, but the real challenge lies in making these apps responsive across a variety of devices. This workshop is all about navigating the world of Flutter to ensure your app looks and works great, whether on mobile, desktop, or web.\nBe prepared to elevate your understanding of responsive app development and create user experiences that shine across every platform.",
    "date": "2024-02-22 09:30",
    "duration": "Workshop",
    "type": "Workshop",
    "tags": "",
    "room": "Workshop Room"
  },
  {
    "conference_name": "Flutter Heroes 2024",
    "talk_author": "Christian Mello",
    "talk_title": "Let's test it with Patrol!",
    "full_abstract": "Automated testing is crucial for ensuring the quality of Flutter apps. Patrol takes it to the next level.",
    "date": "2024-02-22 14:00",
    "duration": "Workshop",
    "type": "Workshop",
    "tags": "",
    "room": "Workshop Room"
  }
]