[
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Craig Labenz",
    "talk_title": "Keynote - Empathetic Flutter",
    "full_abstract": "Explore how Flutter developers can use the best qualities of our technology and community to develop unparalleled software.",
    "date": "2024-09-02 09:30",
    "duration": "45m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Vyacheslav Egorov",
    "talk_title": "Learning something about Dart performance by optimizing jsonDecode",
    "full_abstract": "This talks takes us on a journey through the layers of the cake called \"Dart\". We often hear that jsonDecode is slow in Dart - can we make it faster? Where do we start?",
    "date": "2024-09-02 10:20",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Kilian Schulte",
    "talk_title": "Inside Jaspr: Building a Dart web framework from scratch",
    "full_abstract": "Join me to take an inside look into Jaspr, the web framework for Dart developers. We will dive into the intricate details of the framework and how it works under the hood. Learn how Jaspr is made and what it takes to develop a framework from scratch.Whether you are a seasoned developer or newcomer to Dart, this session lets you step into the next area of Dart development – the web.",
    "date": "2024-09-02 10:20",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Renan Araujo",
    "talk_title": "Flutter web superfast: WASM",
    "full_abstract": "Understand how WASM compilation can turn the tables on the Flutter web performance front.",
    "date": "2024-09-02 11:10",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Majid Hajian",
    "talk_title": "Practical Design Patterns for Flutter Development",
    "full_abstract": "Design patterns, inspired by architectural principles and adapted for software development, are crucial for modern app architecture.Based on the \"FlutterEngineering\" book, this talk highlights essential design patterns in Flutter to help you build efficient and scalable apps.In this talk, we'll explore fundamental concepts and focus on key patterns like Singleton, Factory, and Observer. You'll learn how to implement these patterns effectively in your Flutter projects through practical insights and real-world examples.",
    "date": "2024-09-02 11:10",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Darja Orlova",
    "talk_title": "Zero runtime errors: Exploring Static Code Analysis techniques in Flutter",
    "full_abstract": "If you ask a developer whether they would prefer to fix a bug or develop a new feature, there is no doubt they will select the latter.Unfortunately, bugs are part of the development cycle and are inevitable.Fortunately, there are techniques to predict and prevent them, even without running the code: with the help of static code analysis.Static code analysis is a powerful tool for finding and fixing potential errors even before compiling your code, making the cycle much faster and developers more productive. Moreover, the flexibility of this tool allows you to configure it in a way to not only control bugs but also code style and specific team practices.In this talk, we will do a deep dive into the world of static code analysis, exploring strategies on how to set it up to work best in your project, possibilities beyond `flutter_lints`, such as other libraries and 3rd party services like Dart Code Metrics, as well as what it takes to create your own custom lints for your library or app with tools such as `custom_lint`. By the end of this talk, you will be fully equipped to set up a robust static analysis system in your project and make your projects more reliable, consistent, and performant.",
    "date": "2024-09-02 13:00",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Michał Gapiński",
    "talk_title": "Embedded Flutter on Raspberry Pi 5: Simplification of Daily E-Commerce Operations",
    "full_abstract": "At Pineboards, we specialize in embedded solutions for the Raspberry Pi ecosystem, especially around PCI Express (NVMe, networking, AI Edge TPUs etc). Last year marked our venture into direct retail, pushing us from our engineering comfort zone into the realms of order fulfillment. Our journey from manual inefficiencies to streamlined processes was powered by a custom Flutter application, centralizing operations from order listing to shipping label generation.",
    "date": "2024-09-02 13:00",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Luan Nico",
    "talk_title": "Making a 3D game with Flutter and Flame",
    "full_abstract": "One year after my first talk exploring the realm of 3D within Flame, Flutter now has experimental support for first class GPU access for 3D rendering with Impeler.",
    "date": "2024-09-02 13:50",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Alexandre Moureaux",
    "talk_title": "Flutter & Threads",
    "full_abstract": "Does multithreading, rasterization, or processor affinity sound like big fancy words you'd love to understand? We'll explore all those terms together and discover how Flutter builds frames under the hood! You'll learn how this impacts your app's performance and how to make the correct choices to ensure a smooth app, with concrete code examples and demonstrations. This beginner-friendly talk will demystify complex concepts, guiding you through the threading model and empowering you to create highly performant Flutter apps.",
    "date": "2024-09-02 13:50",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Pavel Sulimau",
    "talk_title": "Code Quality Gates for Large-Scale Flutter Apps",
    "full_abstract": "I'll share insights on guidelines and tools to maintain the quality of a Flutter app.",
    "date": "2024-09-02 14:40",
    "duration": "20m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Simon Auer",
    "talk_title": "Quick Wins - how to make your app more accessible",
    "full_abstract": "Did you know that you can actually make more accessible apps in flutter easily? If yes, why are you not doing that?",
    "date": "2024-09-02 14:40",
    "duration": "20m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Dominik Roszkowski",
    "talk_title": "Native Background Processing with Flutter",
    "full_abstract": "Background processing tends to be one of the afterthoughts with Flutter apps, and I would love to change that. There are several ways to achieve it with Flutter or Dart, although some of them involve a bit of native platform understanding with a pinch of Kotlin or Swift. In this talk I’ll show you how to make it all work without losing your mind, even if you don't have any Android or iOS experience.This talk covers both iOS and Android background processing, with and without utilizing existing Flutter plugins. We'll try to look into desktop background processing as well.",
    "date": "2024-09-02 15:40",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Akanksha Singh",
    "talk_title": "Automating Accessibility Adoption in Flutter using Gemini AI",
    "full_abstract": "For years, accessibility features and experiences were seen as nice to have when it came to app development. Shockingly, many developers overlook this vital aspect, inadvertently excluding a significant user base. The World Health Organization reveals that about 15% of the global population, over a billion people, live with disabilities. In a digital age, it's unjust to marginalize this substantial demographic based on abilities.",
    "date": "2024-09-02 15:40",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Roaa Khaddam",
    "talk_title": "Code Meets Art: Flutter for Creative Coding",
    "full_abstract": "In this talk, I want to show you how you can blur the lines between code and art using Flutter!",
    "date": "2024-09-02 16:30",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Raouf Rahiche",
    "talk_title": "A closer look at the blur effect in Flutter",
    "full_abstract": "Often, when we see a blur effect in designs, we just put in the values, add a backdrop widget, and copy those values, thinking it’s done. Since it’s blurry, it’s tricky to see if it’s right — but it’s “blurry,” so we move forward.",
    "date": "2024-09-02 16:30",
    "duration": "20m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Jochum van der Ploeg",
    "talk_title": "How big are macros really?",
    "full_abstract": "This talk dives into the new experimental macro feature of the Dart language. What is it, what it can do and when to use it.",
    "date": "2024-09-02 16:50",
    "duration": "20m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Sasha Denisov",
    "talk_title": "Porting your mobile app to TV platforms",
    "full_abstract": "Flutter officially supports six platforms (iOS, Android, Web, MacOS, Linux, and Windows). But what if you need to run the Flutter app on the TV platform? Unfortunately, TV platforms have no official support yet. But the Flutter app can be launched on some TV platforms.",
    "date": "2024-09-03 10:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "Devoteam"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Mike Diarmid, Jochum van der Ploeg",
    "talk_title": "Learn how to build real-time games with Flutter and Dart Frog",
    "full_abstract": "In this workshop you'll discover how fun it is to build a game with Flutter while also exploring real-time communication with Dart Frog.",
    "date": "2024-09-03 10:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "NoA"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Moritz Theis, Payam Zahedi",
    "talk_title": "Beyond Mobile: Powering Embedded Devices with Flutter",
    "full_abstract": "This workshop dives into running Flutter on embedded devices, specifically setting it up on the brand new Raspberry Pi 5.",
    "date": "2024-09-03 10:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "NoA"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Alfredo Bautista Santos",
    "talk_title": "Flutter + Gemini: Your AI App Development Launchpad",
    "full_abstract": "Supercharge your Flutter apps with AI!",
    "date": "2024-09-03 13:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "Devoteam"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Muhammed Salih Güler",
    "talk_title": "Building a Cloud-Powered Diary Application with Flutter",
    "full_abstract": "In today's world, having an idea is important, but going to market quickly is as important as having an idea. To achieve this, you need to support iOS, Android, Web, and even Desktop. Fortunately, Flutter is there to help you with that. However, an app without a backend is never enough. To power up your application with a scalable backend, AWS Amplify is there to help you out.",
    "date": "2024-09-03 13:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "NoA"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Çağatay Ulusoy",
    "talk_title": "Advanced Flutter Navigation: Mastering Declarative Navigation",
    "full_abstract": "Implementing the navigation for complex multi-platform applications can be challenging due to varied user interface patterns and navigation structures across different platforms. Flutter’s Navigator 2.0, designed to streamline these complexities, offers a robust framework that empowers developers to manage navigation declaratively. While the Navigator 2.0 API may initially seem advanced and complex, understanding its interplay with the Router and Navigator widgets unlocks powerful customization and flexibility options. In this hands-on workshop, participants will dive deep into integrating the Model-View-ViewModel (MVVM) pattern in a layered architecture with Flutter’s Navigator 2.0 to create clear and efficient navigation management within their apps.",
    "date": "2024-09-03 13:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "NoA"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Simon Lightfoot",
    "talk_title": "Flutter in the year 2044: Discussing a community plan for Flutter’s next 20 years",
    "full_abstract": "To be clear, there is no indication that Google is dropping the ball. But since the projects has seen adoption so many businesses and people, maybe it's time for the community to take on a more active role?",
    "date": "2024-09-03 15:30",
    "duration": "2h 0m",
    "type": "Workshop",
    "tags": "",
    "room": "Devoteam"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Julia Borkowska, Mateusz Wojtczak",
    "talk_title": "Let's test it with Patrol!",
    "full_abstract": "During the workshop, we will prepare the whole E2E testing scenario using Patrol. You will learn how you can use Patrol finders to supercharge your tests and how you can test native features with Patrol native automation. As an example, we will test our Patrol challenge app with Firebase native interactions",
    "date": "2024-09-03 15:30",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "NoA"
  },
  {
    "conference_name": "Flutter & Friends 2024",
    "talk_author": "Lucas Josefiak, Jens Horstmann",
    "talk_title": "Simplify Design Systems and Designer/Developer Collaboration with Widgetbook",
    "full_abstract": "Abstract:",
    "date": "2024-09-03 15:30",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "NoA"
  }
]