[
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Leigha Reid",
    "talk_title": "How FlutterFlow generates Flutter code",
    "full_abstract": "Get a tour of the FlutterFlow application and learn how FlutterFlow generates Flutter code on your behalf. In this talk, we’ll step through some of the core functionalities in FlutterFlow and show how the Flutter code is generated in the produced app.",
    "date": "2024-04-24 10:55 am",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Mateusz Wojtczak, Marcin Chudy",
    "talk_title": "Demystifying App Architecture: The LeanCode Guide",
    "full_abstract": "At LeanCode we developed over 40 Flutter apps, spanning from huge enterprise apps to nimble startup ventures. Some were developed by a single Flutter dev, some came into light through collaborative efforts across multiple teams. Each of them was different. Each of them presented unique challenges and taught us invaluable lessons. In this talk, we invite you to explore different approaches to architecting Flutter apps. Central to our narrative will be the concept of architectural drivers - key factors or priorities that steer our decisions about how the app is structured and designed. We'll show how we leverage our experience when approaching new projects. Drawing from our successes and failures, we'll present our current Flutter stack which enables us to craft robust, scalable, and maintainable applications. While there is no silver bullet for Flutter architecture, we can still have some sensible defaults. Why do we use BLoC for state management? Why not Riverpod? Why do we love hooks? What do we do to avoid reimplementing the same things over and over again? Come to our talk to find out.",
    "date": "2024-04-24 12:15 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Esra Kadah",
    "talk_title": "From Touch To Code: Flutter’s Gesture Mechanics",
    "full_abstract": "How do our everyday interactions with touchscreens shape the apps we use, and what lies beyond the tap? This talk explores the depth of Flutter's gesture recognition mechanism, tracing the journey from touching to screen to the comprehensive handling of gestures within applications. We will check Flutter's ability to transform user interactions, such as taps and swipes, into responsive app features, focusing on converting these gestures into code. The key takeaways for the attendees would be gaining a solid understanding and technical foundation of touchscreens and Flutter’s gesture recognition capabilities. We will get a challenge to rethink the interaction patterns we have and notice how familiar with current approaches. Also, we will gain encouragement to question and rethink conventional interaction patterns for innovation. As a last bullet point, we will understand the impact of habitual user interactions and the potential for creating more intuitive and engaging experiences by redefining gesture standards.",
    "date": "2024-04-24 12:50 pm",
    "duration": "15 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Masahiro Aoki",
    "talk_title": "Enabling Instant Updates in Flutter Apps with Shorebird: My Journey with Code Push",
    "full_abstract": "In this session, I will delve into Shorebird, the eagerly awaited solution that enables instant code updates, also known as Code Push, for Flutter developers. Traditionally, app updates required going through the App Store or Google Play processes. However, with Shorebird, We can now deploy updates directly to end-users' devices instantaneously for Dart-written apps. This session will focus on the fundamentals of Shorebird, the workflow of code push, the patching process, and the advantages and future roadmap of Shorebird in Flutter app development.",
    "date": "2024-04-24 1:05 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Aloïs Deniel",
    "talk_title": "Server-Driven UI with Flutter",
    "full_abstract": "The evolution of mobile application development has ushered in the era of dynamic user interfaces, where Server-Driven UI is rapidly gaining traction. This paper delves into the implementation and advantages of Server-Driven UI with the Flutter framework. The talk begins with an overview of SDUI, explaining its concept and how it differs from traditional client-side rendering. It emphasizes the flexibility and efficiency SDUI brings, allowing developers to update UI elements and user experiences remotely without the need for app updates through traditional app stores. This is particularly beneficial in terms of providing user-specific user interfaces, reducing development time, simplifying A/B testing, and enabling faster iterations. Subsequently, the talk explores the integration of SDUI in Flutter with the help of the RFW (Remote Flutter Widget) package. It details the technical aspects, including the real-time communication between the Flutter app and a Dart-based server, RFW data formatting, and porting RFW and the Flutter Framework to the server. Finally, the talk concludes with an open discussion about the challenges of implementing SDUI in Flutter, such as ensuring performance efficiency and maintaining a seamless user experience.",
    "date": "2024-04-24 3:10 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Lucas Goldner",
    "talk_title": "Flutter Web Laughs: Element Embedding Made Easy",
    "full_abstract": "Flutter Web has been production-ready for some time, yet it remains a topic of lively discussion among developers. Do you know when it's most effective to use Flutter Web? Or where it performs best? A recent feature, Element Embedding, has introduced a new way to integrate Flutter apps into websites, allowing seamless integration with HTML, React, Angular, and more. I've extensively utilized this very underrated feature, recognizing its potential in projects like displaying a Flutter project demo for documentation purposes, as seen here:",
    "date": "2024-04-24 3:45 pm",
    "duration": "15 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Gayathri Devi Srinivasan",
    "talk_title": "Flutter Text: From Pixels to Perfection",
    "full_abstract": "This session explores Flutter's text engine, guiding developers to create captivating, high-performance text experiences. It covers optimizing text rendering, debugging, and components like high-level vs. low-level APIs, advanced layout manipulation, and performance optimization strategies. Key topics include rich text editing, internationalization, and accessibility. Also the session includes live coding, case studies, and benchmarks for practical insights.",
    "date": "2024-04-24 4:00 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Anton Borries",
    "talk_title": "Bring your Flutter App to the HomeScreen - HomeScreen Widgets",
    "full_abstract": "At the latest with interactive Widgets in iOS 17 HomeScreen Widgets are becoming more and more popular. Not only can you give your Users important Information right at a glance it is also valuable screen real estate. A recent study by Duolingo has also shown that having good Homescreen Widgets can help increase daily user sessions. In this talk we will learn how to work around platform limitations to get the best possible HomeScreen Widgets using home_widget",
    "date": "2024-04-24 4:35 pm",
    "duration": "15 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Elaine Dias Batista",
    "talk_title": "Getting Started with GenAI in Flutter Apps",
    "full_abstract": "Have you been hearing about AI but hadn't had the opportunity to look more into it? Are you having trouble seeing how those AI tools can be integrated in your Flutter apps? Join me in this introductory session about GenAI and LLMs where I'll cover some basic definitions around those AI notions. I'll explain the capabilities and limitations of the main solutions out there: Google Gemini, OpenAI ChatGPT, Microsoft Azure AI Studio, Amazon Sagemaker, Hugging Face and others. Finally, I'll cover some interesting use cases that make the most sense for mobile applications.",
    "date": "2024-04-24 5:20 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Maxime Eglem, Michaël Ohayon",
    "talk_title": "Bringing Your Flutter App to the Web",
    "full_abstract": "Our Flutter mobile application Edenred+ is live for a year now. We'll take you on a journey through the exciting process of transforming our company's mobile app into a fully functional web application using Flutter and give you all the insight on how you could bring your code and features to the web.So, whether you're a seasoned developer or just beginning your journey with Flutter, this talk promises to inspire and empower you with insights into the transformative power of Flutter for web development. Join us as we unravel the challenges, triumphs, and innovative solutions encountered along the way.",
    "date": "2024-04-24 5:55 pm",
    "duration": "15 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2024",
    "talk_author": "Loïc Sharma",
    "talk_title": "Into the Flutter-Verse",
    "full_abstract": "Multi-window is coming to Flutter. In this talk we'll see what multi-window apps will look like and learn about the hidden potential it unlocks for all apps, including apps with just a single window!",
    "date": "2024-04-24 6:10 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  }
]