[
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Anton Borries",
    "talk_title": "Hands on Homescreen Widgets for your app",
    "full_abstract": "This year Flutter Connection is introducing a much-awaited new format: trainings! Homescreen Widgets can help your Apps feel just little bit more native and fulfill the expectations of Users towards a modern phone app.\n\nIn this session we’ll cover how home_widget works to bring these experiences to your Flutter App.\n\nYou will learn hands on how to add and configure a Homescreen Widget to your apps as well some best practices for production ready Homescreen Widgets.\n\n📍 Rue Meslay, 75003 Paris, France",
    "date": "2025-04-03",
    "duration": "Workshop",
    "type": "Workshop",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Muhammed Salih Guler",
    "talk_title": "From Flutter to Full-Stack: A Practical Guide to Full-stack Development",
    "full_abstract": "In this hands-on session, we’ll learn about how we can transition to full-stack development, focusing on backend concepts using AWS cloud infrastructure and Dart backend. We’ll demonstrate how to design scalable, secure APIs and integrate them seamlessly into your Flutter apps. Through live coding, we’ll walk you through setting up and deploying your backend, covering key topics like user authentication, cloud storage, and handling real-time data synchronization. By the end of this session, you’ll have the skills to design and deploy secure, scalable backends for your mobile apps and integrate them seamlessly with cloud-native solutions, empowering you to create end-to-end applications ready for production.",
    "date": "2025-04-04 10:45 am",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Manuela Sakura Rommel",
    "talk_title": "Deep Dive into Semantics Widget",
    "full_abstract": "Let’s take a deep dive into Flutter’s Semantics Widget and see how it helps with accessibility and screen readers. I’ll walk you through how semantics work under the hood, how to use semantic widget to improve the user experience, and some best practices for making apps more inclusive. Whether you’re just starting with accessibility or want to fine-tune your implementation, this talk will give you the tools to make your Flutter apps more usable for everyone.",
    "date": "2025-04-04 11:20 am",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Simon Eckerstorfer",
    "talk_title": "Proximity Unlocked: Building Smart Location-Based Matching Apps in Flutter",
    "full_abstract": "Imagine an app that seamlessly detects when users are nearby, matches them based on shared interests, and sends a timely notification to spark a connection—all running effortlessly in the background. In this talk, I’ll show you how to bring this vision to life using Flutter’s capabilities and smart integration techniques. We’ll dive into: - Effortlessly implementing background location tracking with flutter_background_geolocation. - Building an intelligent matching system powered by Supabase. - Designing real-time notifications to create meaningful, proximity-based interactions. - Handling edge cases and ensuring smooth background operations for a seamless user experience. This session will equip you with the tools and techniques to build engaging location-based apps, opening up new possibilities for social, gamification, and utility use cases.",
    "date": "2025-04-04 12:35 pm",
    "duration": "15 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Jaime Blasco",
    "talk_title": "Getting started with Slivers",
    "full_abstract": "Struggling with CustomScrollView and slivers in Flutter? This session demystifies scrollable interfaces, providing a clear path to mastering scrollable UIs. We'll cover fundamentals like, SliverList, enhancements like DecoratedSliver and advanced layouts with SliverMainAxisGroup and SliverCrossAxisGroup. At the end of the session, you will be able to confidently build complex and performant scrollable interfaces in Flutter.",
    "date": "2025-04-04 12:50 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Michael McRoskey",
    "talk_title": "AI-Powered Visual Dev: A New Workflow for Flutter Devs",
    "full_abstract": "This talk will explore how FlutterFlow enables a new development workflow: starting with AI-generated components from screenshots or Figma files (or grabbing a Marketplace item), then exporting those as library packages to integrate directly into existing Flutter apps — with full support for callbacks, iteration, and full ownership of logic in code.",
    "date": "2025-04-04 1:25 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Majid Hajian",
    "talk_title": "Let’s Talk About Memory Leaks In Dart And Flutter",
    "full_abstract": "Memory leaks can be annoying as they are hard to spot and recreate compared to syntax errors or logic bugs usually appearing in the development phase. Memory leaks in Flutter applications are getting even more complex with the addition of layers of widgets and controllers combined with listeners over time, which may result in performance issues or unexpected crashes for users after prolonged use. In this talk, I will explore Dart and Flutter memory leaks and memory bloating, how they occur, their importance in coding practices, solutions to debug memory leaks and identify them, such as DevTools and Leak Tracker, and shifting left by relying on static analyzer tools and how they can prevent such leaks from sneaking into your code base. This talk includes many examples from real applications I have worked on in the last few years.",
    "date": "2025-04-04 3:30 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "François Nollen, Adrien Body",
    "talk_title": "A Journey to Continuous Delivery with Flutter ⚡️🚀🙂",
    "full_abstract": "Continuous Delivery consists in getting changes to production, safely and quickly in a sustainable way. The State of DevOps Report and DORA state successful companies deploy more than once a day - possibly rolling back in less than an hour! Providing a Flutter mobile app with new features/fixes to release every day, assuming your CI/CD pipeline rocks… still you have to submit and comply with Stores rules, policies and rollout strategies. How can you achieve CD in practice? From our journey to CD with a business-critical Flutter app, millions of Android/iOS users and dozens of changes every day, come and learn what we've learned so far, the limits we've met and our results leveraging various tools and techniques - including Feature Flags, Beta releases, Shorebird, LaunchDarkly and more. Innovate faster, deploy safer.",
    "date": "2025-04-04 4:05 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Mangirdas Kazlauskas",
    "talk_title": "From fear to air: embracing over-the-air app updates",
    "full_abstract": "Repeat after me: app updates are stressful. Dealing with app store reviews and worrying about disrupting users can make anyone hesitant to release new features. But what if there was a better way? Over-the-air (OTA) updates let you deliver changes directly to your users, super fast and without any fuss. In this talk, we’ll explore various OTA update techniques, from simple tools to advanced methods like code push for instant fixes, feature flags for controlled rollouts and A/B testing, server-driven UI for dynamic content, and even generative AI for personalized experiences. By the end of this talk, you’ll be ready to embrace OTA updates, ship features faster, keep users happy, and turn app updates into an exciting opportunity for continuous improvement.",
    "date": "2025-04-04 4:40 pm",
    "duration": "15 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Aloïs Deniel",
    "talk_title": "Bringing Flutter to the terminal",
    "full_abstract": "The resurgence of Terminal User Interfaces (TUIs) has sparked renewed interest in creating robust terminal apps. However, developing TUIs with Dart can be challenging due to the lack of a dedicated framework—until now! While a few packages exist, none offered the seamless experience developers have come to expect from Flutter for mobile and desktop. In this talk, I’ll introduce a Flutter-inspired framework I developed specifically for building terminal apps. Leveraging your existing Flutter skills, you can create engaging and functional terminal applications with ease. Join me to explore how this framework brings the power and familiarity of Flutter to the terminal!",
    "date": "2025-04-04 4:55 pm",
    "duration": "15 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Alicja Ogonowska",
    "talk_title": "Listen up! Mastering A/B testing and feedback techniques in your mobile apps",
    "full_abstract": "In the world of mobile app development, truly understanding and catering to your users' needs can be the difference between an app that thrives and one that just survives. In this talk, we'll focus on how to effectively gather and use feedback from users within Flutter apps, turning it from an overlooked aspect to a core part of your development process. We'll start by exploring a variety of ways to ask for feedback. We'll look at gentle, almost unnoticed prompts within the app, as well as more straightforward methods. But gathering feedback is just the beginning. Next, we'll take a deep dive into A/B testing. This is a powerful tool that can help you understand what your users prefer and how they behave. I will show you how to set up effective tests, interpret the results, and use this information to make decisions about your app. By the end of this talk, you'll have a better understanding of how to listen to your users and use their feedback to improve your app. You'll learn how to build Flutter apps that are shaped by your users' needs and wants, rather than just your initial ideas. This user-focused approach will help you create apps that your users love and keep coming back to. So, let's start listening to our users and making apps that truly meet their needs!",
    "date": "2025-04-04 5:55 pm",
    "duration": "15 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Anton Borries",
    "talk_title": "Saving Time and CO₂ - A story about a custom Design System",
    "full_abstract": "At the start of 2023, we set out to create a Design System for our company. We decided early on to let our Design Team drive decisions about structure and components, while our tech teams adapted their setups to support this approach. This led to the creation of Harmonized, a design system now powering 8 (and counting) projects across our company. In this talk, we’ll share: -Getting C-level and stakeholder buy in to tokenize & componentize. - Our custom pipeline from Figma to Flutter. - How we enhanced collaboration between Design and Development. - The story of migrating an app to an entirely new visual style behind a feature flag. - How we dramatically improved our delivery speed — adding Dark Mode, in less than a week. Join us to learn how Harmonized is enabling consistency, efficiency, and innovation across our digital ecosystem.",
    "date": "2025-04-04 6:10 pm",
    "duration": "15 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  },
  {
    "conference_name": "Flutter Connection 2025",
    "talk_author": "Lucas Josefiak",
    "talk_title": "Simplify app development by building widgets in isolation",
    "full_abstract": "When was the last time you had to ensure that your new feature works well in all required states but this feature was deep down in your app and you had to use hot restart, and navigate back and forth to test all required states? Do you remember how it felt? Did you try to tear your skin off your face because it was so f******* tedious? No worries, you’re not aloneThat is how I felt for years… I wanted to make it stop. I’m happy to tell you that I built a solution! Widgetbook - an open-source Flutter package that allows you build your components in isolation.In this talk, you’ll learn: • How to build widgets in isolation • How to quickly test your widgets in all different states • How to review your own (and your team’s) UI changes in your Git environment without the need to checkout the code locally and run it to see how it looks like",
    "date": "2025-04-04 6:25 pm",
    "duration": "35 min",
    "type": "Talk",
    "tags": "",
    "room": ""
  }
]