[
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Ogawa & Yamamoto",
    "talk_title": "Seamless Passkey Authentication with Flutter x Firebase",
    "full_abstract": "Flutter Tech Lead @Money Forward, Inc. & Freelance mobile app developer\n\nPasswords are out. Passkeys are in. Join us for a deep dive into the cutting-edge world of passwordless authentication as we explore how to implement Passkeys in Flutter apps using Firebase.\n\nIn Money Forward, we have implemented a passkey authentication into our Banking app created with Flutter. This session will take you behind the scenes of our real-world journey integrating Passkey authentication into a banking app, balancing security, user experience, and technical complexity.\n\nSession will be divided into three parts.\n1. Overview on the Passkey technology and it's requirements\n2. Step by step guide on implementing Passkey with Flutter x Firebase\n3. Tips and difficulties that we've faced along the way of implementing to our app\n\nWe\\u2019ll start with a crash course on Passkey technology and its security advantages, then break down the critical requirements for mobile implementation.\n\nYou\\u2019ll get a step-by-step walkthrough of integrating Passkeys with Flutter, Firebase Functions, Firestore, and Firebase Auth to deeper your understanding on how to implement Passkeys into your app.\n\nBut we won\\u2019t sugarcoat the challenges: learn from our pitfalls, from platform-specific quirks to biometric edge cases, and discover pro tips for optimizing UX without compromising security.\n\nWhether you\\u2019re building fintech apps or consumer products, walk away with actionable insights and the confidence to bring modern authentication to your Flutter projects.\n\nPerfect for: Flutter developers, Firebase enthusiasts, and anyone passionate about secure, frictionless user experiences.",
    "date": "2025-05-29 10:30 AM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Sasha Denisov",
    "talk_title": "Building Flutter Apps with AI capabilities without Connection, Bills and Privacy Concerns",
    "full_abstract": "EPAM, Chief Software Engineer, Flutter and Dart GDE\n\nGet ready to explore TV app development using Flutter. While Flutter officially supports various platforms, TV platforms like Android TV and Apple TV have been overlooked. But fear not! In this workshop, we'll show you how to bring your Flutter apps to the big screen.\n\nIn this workshop, we will go through all the steps of porting your mobile app to the big screen, discuss all the nuances of TV apps, such as controlling the app with a remote control, and finally launch the app on a TV platform, not only on Android TV, but also on Apple TV",
    "date": "2025-05-29 11:25 AM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Ashita Prasad",
    "talk_title": "Unleashing Peak Performance: Mastering Flutter DevTools",
    "full_abstract": "GDE - Dart & Flutter | Founder, API Dash & fluttergems.dev\n\nWith more than 10 million apps available across iOS and Android stores, it is difficult to get downloads, but even harder to retain users. Performance of an app plays a key role in retaining users and building a high-performance Flutter app isn\\u2019t just about writing clean code\\u2014it\\u2019s about optimizing every aspect of your app\\u2019s performance. In this session, we\\u2019ll unlock the full potential of Dart & Flutter DevTools, exploring its powerful features to diagnose bottlenecks, reduce jank, and optimize rendering. You\\u2019ll learn how to analyze CPU and memory usage, profile animations, and fine-tune your app for peak efficiency. Whether you\\u2019re a beginner or an experienced developer, this talk will equip you with practical techniques to make your Flutter apps smoother, faster, and more efficient. Get ready to unleash peak performance and take your Flutter skills to the next level!",
    "date": "2025-05-29 01:30 PM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Akansha Jain",
    "talk_title": "Offline-First Flutter: Building Resilient Apps for Unreliable Networks",
    "full_abstract": "Organizer of Flutter Conf India and Flutter Delhi\n\nAbstract:\nMany apps break when the internet does. Users in areas with unstable networks face frustrating experiences, data loss, and app crashes. But what if our Flutter apps could work seamlessly offline and sync automatically when back online?\n\nIn this session, I\\u2019ll share practical offline-first strategies using Hive, SQLite, and caching techniques to keep apps functional without constant internet. I\\u2019ll also discuss syncing data, handling conflicts, and best practices to build apps that stay fast, reliable, and user-friendly\\u2014no matter the network conditions.\n\nIf you\\u2019ve ever struggled with offline support, this talk will give you the tools and patterns to build apps that users can trust\\u2014even with zero connectivity.\n\nDescription:\nA few years ago, I built a Flutter app for users in remote areas, only to realize most of them didn\\u2019t have reliable internet. The app failed when users needed it most. That experience taught me a key lesson: Offline support isn\\u2019t a feature, it\\u2019s a necessity.\n\nMany developers assume users will always be online, but that\\u2019s rarely the case. Whether they\\u2019re traveling, in low-connectivity zones, or facing network issues, users expect apps to just work. This session will break down how to build an offline-first Flutter app that stays functional even in zero-network conditions.\n\nWhat we\\u2019ll cover:\n\\u2705 How to store and manage offline data with Hive, and SQLite.\n\\u2705 Caching and background sync techniques to improve performance.\n\\u2705 Handling conflicts when offline and online changes collide.\n\\u2705 Real-world best practices to build apps that don\\u2019t rely on the internet.\n\nBy the end of this talk, you\\u2019ll have a clear roadmap for making your Flutter apps more resilient, performant, and user-friendly\\u2014even when the internet isn\\u2019t there to help.\n\nKey Takeaways:\n\\u2705 Why offline-first matters and how it improves UX.\n\\u2705 Best practices for caching, syncing, and data persistence in Flutter.\n\\u2705 How to avoid common pitfalls and handle offline-online data conflicts.\n\\u2705 Tools and strategies to make apps more reliable and efficient.",
    "date": "2025-05-29 02:25 PM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Csongor Vogel",
    "talk_title": "KonMari your Flutter code using DCM",
    "full_abstract": "GDE - Dart & Flutter /  Staff Software Engineer @talabat (Delivery hero)\n\nAs Flutter projects scale, code clutter increases: unused files, oversized widgets, and spaghetti dependencies slow down development. What if we could organize our codebase like we tidy our homes?\n\nInspired by Marie Kondo\\u2019s KonMari Method, this talk explores organizing and maintaining Flutter codebases using DCM (Design Code Metrics).\n\nWe will recap the latest features that DCM provides to eliminate unnecessary code, optimize widgets, manage assets, and address code smells and violations.\nBy the end of this talk, developers will learn multiple approaches to reducing technical debt, improving code quality, and maintaining a codebase that truly \\u201csparks joy\\u201d.\n\nKey Takeaways:\n- Showcase cleanup strategies to identify and remove unused code, assets, and inefficient widgets.\n- Applying DCM for code health by using static analysis, widget insight to increase quality.\n- Using metrics to reveal features that are challenging to scale and modify.\n\nTarget Audience:\nFlutter developers of all levels who are interested in improving code quality, optimizing performance, and cleaning up their projects, especially those working on large codebases.\n\nLink: https://dcm.dev/",
    "date": "2025-05-29 03:35 PM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Festus Olusegun",
    "talk_title": "Decoding Dart: A Look at the DartVM",
    "full_abstract": "GDE - Dart & Flutter\n\nEvery Dart app runs on the Dart Virtual Machine (DartVM)\\u2014but what\\u2019s really happening under the hood? This session takes you behind the scenes of DartVM, breaking down how it executes code, optimizes performance, and manages memory. Whether you're just starting or have years of experience, understanding DartVM will help you write better, more efficient apps across mobile, web, and beyond.\n\nIn this session, we'll break down DartVM\\u2019s architecture, JIT vs. AOT compilation, and garbage collection, giving you practical insights to optimize your Dart apps for performance and scalability\\u2014all distilled from my years of experience deploying and fine-tuning Dart/Flutter applications.",
    "date": "2025-05-29 04:30 PM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Kenichi Kambara",
    "talk_title": "Adapting Flutter App UX for Users Across the World",
    "full_abstract": "NTT TechnoCross Corporation Principal Evangelist\n\nDelivering a Flutter app globally means adapting to different languages, cultures, and user behaviors. Ensuring a seamless user experience (UX) for diverse audiences requires thoughtful design and implementation.\n\nThrough my journey of visiting over 50 countries, I gathered real user feedback by demonstrating my app in various environments. While some users interacted with the app as expected, others struggled due to differences in language, navigation habits, and device usage patterns. These insights shaped my approach to UX enhancements.\n\nIn this session, we'll explore key challenges and practical solutions, including:\n\n- Multilingual Support: Handling multiple languages, including right-to-left (RTL) text\n- User Onboarding: Implementing intuitive tutorials and clear instructions\n- UI Optimization: Designing adaptive layouts for different screen sizes and devices\n- Cultural Considerations: Customizing UX elements to match diverse user expectations\n\nI'll provide real-world code examples in Flutter/Dart, demonstrating concrete steps to enhance your app's UX. Specifically, I will cover:\n\n- Decision-Making Process: How real user feedback influenced design and feature improvements\n- Implementation Steps: Practical methods to refine UX for global users\n- Key UX Principles: Strategies for making apps more accessible and intuitive\n- Code Examples: Hands-on solutions to address the mentioned challenges\n\nBy the end of this session, attendees will gain actionable insights and practical techniques to improve their Flutter app\\u2019s UX, making it more intuitive and engaging for users worldwide.",
    "date": "2025-05-29 05:40 PM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Majid Hajian",
    "talk_title": "Let's Talk About Memory Leaks in Dart And Flutter",
    "full_abstract": "GDE - Dart & Flutter / @Microsoft\n\nMemory leaks can be annoying as they are hard to spot and recreate compared to syntax errors or logic bugs usually appearing in the development phase. Memory leaks in Flutter applications are getting even more complex with the addition of layers of widgets and controllers combined with listeners over time, which may result in performance issues or unexpected crashes for users after prolonged use.\nIn this talk, I will explore Dart and Flutter memory leaks and memory bloating, how they occur, their importance in coding practices, solutions to debug memory leaks and identify them, such as DevTools and Leak Tracker, and shifting left by relying on static analyzer tools and how they can prevent such leaks from sneaking into your code base.\nThis talk includes many examples from real applications I have worked on in the last few years.",
    "date": "2025-05-30 10:30 AM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Masahiro Aoki",
    "talk_title": "Mastering Shortcuts in Flutter: Building Desktop and Web Apps",
    "full_abstract": "Founder of OpenCI\n\nAs Flutter expands beyond mobile to desktop and web platforms, keyboard shortcuts become critical for user experience. While implementing simple global shortcuts is straightforward, creating context-aware keyboard interactions that respect focus state and component hierarchy presents significant challenges for developers.\nThis session explores Flutter's powerful but often overlooked Actions and Shortcuts system. Whether building a text editor where shortcuts behave differently based on selection state, or creating complex desktop applications with sophisticated keyboard navigation, understanding Flutter's shortcut architecture is essential for delivering professional multi-platform experiences.\nDrawing from real-world experience developing macOS applications, this talk will demystify the architecture that enables both simple global shortcuts and complex context-sensitive keyboard interactions.\n\nKey Takeaways from This Session\n1. Understand Flutter's Actions and Shortcuts Architecture: Learn how the Intent-Action pattern enables flexible keyboard interactions across different contexts\n2. Master Context-Aware Keyboard Shortcuts: Implement shortcuts that behave differently based on focus state (e.g., disabling shortcuts when a TextField has focus)\n3.Build Platform-Adaptive Shortcut Systems: Create applications that respect platform conventions for keyboard shortcuts across web, Windows, macOS, and Linux\n4. Integrate Shortcuts with Application State: Connect keyboard actions to your state management solution for clean, maintainable code\n5. Troubleshoot Common Shortcut Issues: Diagnose and resolve focus, propagation, and collision problems in keyboard shortcuts\n\nTarget Audience\nThis session is ideal for Flutter developers who are:\n1. Building applications for desktop (Windows, macOS, Linux) or web platforms\n2. Creating professional productivity applications where keyboard interaction is essential\n3. Looking to enhance accessibility through comprehensive keyboard support\n4. Transitioning from mobile-only to cross-platform Flutter development",
    "date": "2025-05-30 11:25 AM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Samuel Abada",
    "talk_title": "State Restoration – Making The Dead State Live Again",
    "full_abstract": "GDE - Dart & Flutter | Co-organizer of the Flutter Lagos & Flutter Akure\n\nEver closed an app, only to return and find it exactly where you left off? Join me in this session where we'll uncover the secrets behind this magic trick known as state restoration in Flutter. I'll walk you through the essentials of preserving and restoring your app's state, ensuring a seamless experience for your users. We'll explore practical examples and insider tips to implement state restoration using Flutter's RestorationMixin and RestorationBucket classes. By the end of the session, you'll leave equipped with the knowledge and skills to implement state restoration in your Flutter apps.\n\nKey Takeaways:\n\n- Understand the significance of state restoration in mobile apps.\n- Learn practical techniques to implement state restoration using Flutter's built-in tools. No magic wand required.\n- Gain insights into handling common challenges like navigation history, text fields, scrollables, dialogs/pickers.\n- Discover best practices, tips, tricks and plot twists of state restoration.\n- Explore advanced strategies to enhance your app's state restoration capabilities.",
    "date": "2025-05-30 01:30 PM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Yugo Sugiyama",
    "talk_title": "Exploring Flutter Path Animations",
    "full_abstract": "DeNA Co., Ltd.\n\nIn this talk, I\\u2019ll talk about Flutter Path animations. Specifically, you will gain insight into the following topics:\n\n1. How to express complex shape Paths in Flutter\n2. How Flutter Path animation works\n3. How to animate a path from its start point to its end point\n\nBy utilizing these technologies, animations that have been expressed using mp4 or lottie may be completely replaced with Flutter implementations.\nI think this is a very challenging attempt for engineers who develop apps for the Flutter, and also an interesting attempt that will pique their technical interest.\nAnd today I would like to demonstrate some content that makes use of this knowledge.",
    "date": "2025-05-30 02:25 PM",
    "duration": "20 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Mike Diarmid",
    "talk_title": "The Human Side of Flutter's Success Story",
    "full_abstract": "GDE - Firebase / @FlutterFlow / Former CTO & Founder of Invertase\n\nBehind every successful technology lies a powerful community. Flutter's rise isn't just a story of excellent cross-platform development\\u2014it's a testament to the diverse, vibrant, and inclusive community that powers its growth. This talk takes you beyond the widgets and deep into the human ecosystem that makes Flutter unique in today's tech landscape.\n\nThrough real-world stories and community data, we'll explore how Flutter's community has evolved from early adopters to a global force for technological innovation and professional growth. You'll discover how diversity initiatives, education programs, and regional communities have shaped Flutter's development, making it more accessible and powerful for developers worldwide.\n\nWhether you're a Flutter enthusiast, community leader, or curious developer, you'll leave understanding how community-driven development can transform both technology and careers.",
    "date": "2025-05-30 02:50 PM",
    "duration": "20 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Tsuyoshi Chujo",
    "talk_title": "Haskell: Lead Your Code to the Next Level",
    "full_abstract": "Freelance mobile apps developer\n\nOne of the most important concepts of Flutter is the \\u201cWidget tree.\\u201d Widgets\\u2019 styles are provided through the widget tree, the widget tree manages states, and rebuilds are optimized based on the mechanism of the widget tree. Understanding how widget tree works is crucial to enhancing the quality of our apps.\n\nYet, developers often explore options beyond the widget tree, such as using packages for state management, to address the challenges in development. While depending on external packages quickly solves our problems, it also introduces risks or costs of complexity and fear of breaking changes.\n\nThis session aims to demystify the widget tree's capabilities, revealing how it can solve everyday challenges.\n\nI will start by taking a closer look at the widget tree's mechanism. After that, I will explain how the Flutter framework and each widget use it internally. Finally, the session will end with the main discussion of how we can maximize the mechanism's potential.\n\nAfter listening to this session, you will be able to\n\n- Efficiently manage styling and state\n- Design your widgets to be more portable and testable\n- Reduce needless dependencies on packages\n- Easily understand Flutter docs\n\nAlthough this session doesn't introduce unique technologies or trendy packages, this section equips you with fundamental knowledge that will empower your projects across the board.",
    "date": "2025-05-30 03:40 PM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  },
  {
    "conference_name": "Flutter Ninjas 2025",
    "talk_author": "Remi Rousselet",
    "talk_title": "Macros are gone. What now?",
    "full_abstract": "Guest Speaker / The creator of Riverpod\n\nThe Dart team announced that Macros will not be coming to Dart.Let's chat about how this will impact my packages and the ecosystem as a whole",
    "date": "2025-05-30 04:35 PM",
    "duration": "40 min",
    "type": "Talk",
    "tags": "",
    "room": "docomo R&D OPEN LAB ODAIBA"
  }
]