[
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Filip Hracek",
    "talk_title": "The Boring Keynote",
    "full_abstract": "This talk celebrates the \"boring\" features of Flutter & Dart that don't normally get all that attention but that are at least as important as the big ticket features. The things that are important for big production projects aren't necessarily the same ones as those important for demos.",
    "date": "2025-09-01 09:30",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Slava Egorov",
    "talk_title": "What is an Isolate anyway?",
    "full_abstract": "This is a talk about the past, present and future of the Dart concurrency model. How and why did Dart end up with Isolates? How did they evolve over the years and where we are taking them in the future.",
    "date": "2025-09-01 10:15",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Enzo Conty",
    "talk_title": "Making your app WCAG 3.0 compliant in 40 minutes!",
    "full_abstract": "In this session, we will break down WCAG 3.0 guidelines and show you actionable steps to make your app fully accessible in 40 minutes. You'll learn how to audit, fix, and test common accessibility issues, ensuring the experience for everyone, including people with various disabilities. We will take a deep dive into some complex accessibility challenges like accessible charts, keyboard support and even image descriptors.",
    "date": "2025-09-01 10:15",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Roaa Khaddam",
    "talk_title": "Visualizing Algorithms on the Flutter Canvas",
    "full_abstract": "Throughout the history of computing, layer upon layer of abstraction has been introduced to the way we build software. From writing raw machine code, to abstracting away the writing of the code itself. This talk is about building a deeper understanding of the core ideas and algorithms that persisted through these layers.",
    "date": "2025-09-01 11:00",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Albert Wolszon",
    "talk_title": "How to write a button if there was no Material (or Cupertino)",
    "full_abstract": "When using components provided by the framework we don’t pay attention to some of important parts of them that make them really production-grade. In this talk I’ll go through developing a simple button in Flutter, but using the most primitive widgets and without using Material or Cupertino, and making the button still fully usable and accessible, to all users the app can have.",
    "date": "2025-09-01 11:00",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Remi Rousselet",
    "talk_title": "State management is hard. Here's why.",
    "full_abstract": "A recurring comment you can find when discussing state-management is: \"Why use X package when you could just use InheritedWidget/StatefulWidget/...?\"",
    "date": "2025-09-01 12:45",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Rūdolfs Agris Stilve",
    "talk_title": "Is your app faster with \"const\"?",
    "full_abstract": "Is it worth taking the time to pepper the \"const\" keyword everywhere possible, and is there a tangible end-user benefit? Small, isolated benchmarks can paint conclusions in one or the other way, but what about a complex real-world scenario? The basis of this talk is an experiment where the \"const\" keyword has been ejected from a near-100k LoC production app.",
    "date": "2025-09-01 12:45",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Anna Leushchenko",
    "talk_title": "Behind the @ – Dart Annotations in Depth",
    "full_abstract": "As Flutter developers, you’ve almost certainly encountered annotations like `@override` and `@deprecated`. But Dart’s annotation system offers much more than just these built-in cases, yet this feature remains underused in the majority of projects.",
    "date": "2025-09-01 13:30",
    "duration": "20m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Ingvild Sandstad",
    "talk_title": "Using the MultiChildRenderObjectWidget",
    "full_abstract": "The talk will focus on how we can make quite simple use of the MultiChildRenderObjectWidget to solve having your own, specific layout rules for a set of widgets. We will look at some use cases where it could be useful, analyse some code and output of the results.",
    "date": "2025-09-01 13:30",
    "duration": "20m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Morgan Hunt",
    "talk_title": "Architecting for 15 Million Users",
    "full_abstract": "Scaling an app to millions of users requires more than just writing efficient code—it demands a solid architectural foundation that balances performance, maintainability, and developer experience. In this talk, I’ll break down key architectural decisions that enable apps to scale while keeping the codebase modular, testable, and maintainable.",
    "date": "2025-09-01 14:00",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Mateusz Wojtczak",
    "talk_title": "Mastering Efficiency in 2025: Build Apps Faster with Flutter",
    "full_abstract": "The mobile landscape is evolving rapidly. In 2025, efficiency reigns supreme. This talk cuts through the noise and delivers a practical roadmap for building high-quality Flutter apps with less effort. We’ll explore proven strategies for maximizing your productivity, including:",
    "date": "2025-09-01 14:00",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Renan Araujo",
    "talk_title": "Flame and shaders: The post processing API",
    "full_abstract": "The new post-processing API on Flame promises to allow Flutter-based games to look as good as any of the best-looking 2D games in the industry. Let's see how with never-before-seen examples.",
    "date": "2025-09-01 15:45",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Elias Elfarri",
    "talk_title": "Either This or That: Expressive Error Handling in Dart",
    "full_abstract": "Functional programming patterns like Either and Result are widely used in languages like Rust, Haskell, and Go to enable safe, expressive, and explicit error handling. However Dart doesn’t support this pattern out of the box—so at InlineX, we decided to build it ourselves.",
    "date": "2025-09-01 15:45",
    "duration": "20m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Sandra Lundh",
    "talk_title": "Test Semantics with Golden Tests",
    "full_abstract": "While semantics aren't visible to the average user, they are essential for users relying on screen readers. So visualising their impact, like how semantics affect your UI, gives you indirect visibility into how accessible your app is.",
    "date": "2025-09-01 16:10",
    "duration": "20m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Martin Olsson",
    "talk_title": "Flutter Goes to Sea - Building Next Generation Marine Interfaces in Flutter",
    "full_abstract": "Candela builds boats that fly. The Candela P-12 is the world’s first electric hydrofoiling ferry, now in public service in Stockholm and beyond. While the tech that makes her fly across the water is complex, driving her is simple - thanks to genius-level control systems and a Flutter-powered UI.",
    "date": "2025-09-01 16:35",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Studio stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Jamie Kerber",
    "talk_title": "The Flutter Grimoire: A Practical Guide to Your First PR",
    "full_abstract": "In this talk we'll demystify the secrets of contributing to Flutter with a clear, phase-by-phase walkthrough designed to turn intimidation into inspiration. You’ll discover how contributing sharpens your skills and creates an impact—whether you’re fixing long-standing bugs, improving widgets or documentation, or adding new features.",
    "date": "2025-09-01 16:35",
    "duration": "40m",
    "type": "Talk",
    "tags": "",
    "room": "Main stage"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "TBA",
    "talk_title": "Badge hack and Game hack",
    "full_abstract": "This is a super laid back hangout where you can hack on a game, your badge or why not a bit of both?",
    "date": "2025-09-02 10:00",
    "duration": "6h 0m",
    "type": "Workshop",
    "tags": "",
    "room": "https://maps.app.goo.gl/E61SAPjj8JEPCgDj8"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Moritz Theis, Alexander Thiele",
    "talk_title": "Build Your Own Flutter AI Sidekick",
    "full_abstract": "In this hands-on workshop, we’ll build a tiny AI assistant that lives inside a Flutter app—think of it as a “mini ChatGPT” tailored to a specific theme like travel, cooking, or even Flutter documentation.",
    "date": "2025-09-02 10:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "Widget track"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Pooja Bhaumik",
    "talk_title": "Building Flutter Packages & Modules Visually",
    "full_abstract": "Developers often rely on packages and modules to extend functionality and keep projects modular. In this workshop, we’ll showcase how pub package authors and Flutter teams can create reusable modules or packages with FlutterFlow and DreamFlow and add them to existing Flutter projects.",
    "date": "2025-09-02 10:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "Dash Track"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Lucas Josefiak",
    "talk_title": "Translate Figma Designs to maintainable Flutter Code with Widgetbook MCP",
    "full_abstract": "Learn how to finally generate maintainable Flutter code from your Figma designs. In this hands-on workshop, you will use code generation to implement a Figma component in an existing Flutter project by using the Widgetbook MCP server. You can apply this workflow to any Flutter project afterward.",
    "date": "2025-09-02 13:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "Widget track"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Ivanna Kaceviča, Esra Kadah",
    "talk_title": "Flutter Vibes Only: Join Us for the Flutter Vibe-Coding Workshop",
    "full_abstract": "What is the state of vibe-coding with Flutter in late 2025?",
    "date": "2025-09-02 13:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "Dash track"
  },
  {
    "conference_name": "Flutter & Friends 2025",
    "talk_author": "Luan Nico, Jochum van der Ploeg",
    "talk_title": "Flame 3D - Hands-On Workshop",
    "full_abstract": "Carefully crafted by the minds behind the project, Jochum (wolfenrain) and Luan (luanpotter), this is an introductory workshop to teach you the very basics to get you up and running with our new package `flame_3d` which allows you to build 3D games with Flame. This is intended for people with little to no prior experience with 3D games, in Flame or otherwise, but with maybe some experience with Flutter and Dart. The workshop will be focused on a practical and hands-on getting-something-done approach, rather than focusing on background math and theory that is handled for you by flame_3d.",
    "date": "2025-09-02 15:00",
    "duration": "1h 30m",
    "type": "Workshop",
    "tags": "",
    "room": "Widget track"
  }
]